Masmiseim36/nxpSDK/devices/MIMXRT735S/periph/PERI_CLKCTL4.h
#define CLKCTL4_SDIO0FCLKDIV_BUSY_MASK           (0x10000000U)
#define CLKCTL4_SDIO0FCLKDIV_BUSY_SHIFT          (28U)
/*! BUSY - Busy Flag
 *  0b0..The CLKOUT is outputted with the new divider value.
 *  0b1..A change is being made to the divider value.
 */
#define CLKCTL4_SDIO0FCLKDIV_BUSY(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL4_SDIO0FCLKDIV_BUSY_SHIFT)) & CLKCTL4_SDIO0FCLKDIV_BUSY_MASK)

#define CLKCTL4_SDIO0FCLKDIV_RESET_MASK          (0x20000000U)
#define CLKCTL4_SDIO0FCLKDIV_RESET_SHIFT         (29U)
/*! RESET - Divider counter Reset
 *  0b0..No effect
 *  0b1..Resets the divider counter.
 */
#define CLKCTL4_SDIO0FCLKDIV_RESET(x)            (((uint32_t)(((uint32_t)(x)) << CLKCTL4_SDIO0FCLKDIV_RESET_SHIFT)) & CLKCTL4_SDIO0FCLKDIV_RESET_MASK)

#define CLKCTL4_SDIO0FCLKDIV_HALT_MASK           (0x40000000U)
#define CLKCTL4_SDIO0FCLKDIV_HALT_SHIFT          (30U)
/*! HALT - Divider Counter Halt
 *  0b0..No effect
 *  0b1..Halts (stops) the divider counter.
 */
#define CLKCTL4_SDIO0FCLKDIV_HALT(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL4_SDIO0FCLKDIV_HALT_SHIFT)) & CLKCTL4_SDIO0FCLKDIV_HALT_MASK)

#define CLKCTL4_SDIO0FCLKDIV_REQFLAG_MASK        (0x80000000U)
#define CLKCTL4_SDIO0FCLKDIV_REQFLAG_SHIFT       (31U)
/*! REQFLAG - Request Flag
 *  0b0..The change to the divider value has been finished.
 *  0b1..The change is being made to the divider value.
 */
#define CLKCTL4_SDIO0FCLKDIV_REQFLAG(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL4_SDIO0FCLKDIV_REQFLAG_SHIFT)) & CLKCTL4_SDIO0FCLKDIV_REQFLAG_MASK)
/*! @} */

/*! @name SDIO1FCLKSEL - SDIO1 Functional Clock Source Select */
/*! @{ */

#define CLKCTL4_SDIO1FCLKSEL_SEL_MASK            (0x3U)
#define CLKCTL4_SDIO1FCLKSEL_SEL_SHIFT           (0U)
/*! SEL - SDIO1 Clock Source Select
 *  0b00..VDDN_MEDIA base clock
 *  0b01..Audio PLL PFD0 clock
 *  0b10..fro0_max
 *  0b11..Main PLL PFD1 clock
 */
#define CLKCTL4_SDIO1FCLKSEL_SEL(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL4_SDIO1FCLKSEL_SEL_SHIFT)) & CLKCTL4_SDIO1FCLKSEL_SEL_MASK)

#define CLKCTL4_SDIO1FCLKSEL_SEL_EN_MASK         (0x4U)
#define CLKCTL4_SDIO1FCLKSEL_SEL_EN_SHIFT        (2U)
/*! SEL_EN - Clock Mux Output Enable
 *  0b0..Gates mux output for SD/MMC/SDIO interface 1 clock.
 *  0b1..Enables mux output for SD/MMC/SDIO interface 1 clock.
 */
#define CLKCTL4_SDIO1FCLKSEL_SEL_EN(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL4_SDIO1FCLKSEL_SEL_EN_SHIFT)) & CLKCTL4_SDIO1FCLKSEL_SEL_EN_MASK)
/*! @} */

/*! @name SDIO1FCLKDIV - SDIO1 Functional Clock Divider */
/*! @{ */

#define CLKCTL4_SDIO1FCLKDIV_DIV_MASK            (0xFFU)
#define CLKCTL4_SDIO1FCLKDIV_DIV_SHIFT           (0U)
/*! DIV - Clock Divider Value Select */
#define CLKCTL4_SDIO1FCLKDIV_DIV(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL4_SDIO1FCLKDIV_DIV_SHIFT)) & CLKCTL4_SDIO1FCLKDIV_DIV_MASK)

#define CLKCTL4_SDIO1FCLKDIV_BUSY_MASK           (0x10000000U)
#define CLKCTL4_SDIO1FCLKDIV_BUSY_SHIFT          (28U)
/*! BUSY - Busy Flag
 *  0b0..The CLKOUT is outputted with the new divider value.
 *  0b1..A change is being made to the divider value.
 */
#define CLKCTL4_SDIO1FCLKDIV_BUSY(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL4_SDIO1FCLKDIV_BUSY_SHIFT)) & CLKCTL4_SDIO1FCLKDIV_BUSY_MASK)

#define CLKCTL4_SDIO1FCLKDIV_RESET_MASK          (0x20000000U)
#define CLKCTL4_SDIO1FCLKDIV_RESET_SHIFT         (29U)
/*! RESET - Divider Counter Reset
 *  0b0..No effect
 *  0b1..Resets the divider counter.
 */
#define CLKCTL4_SDIO1FCLKDIV_RESET(x)            (((uint32_t)(((uint32_t)(x)) << CLKCTL4_SDIO1FCLKDIV_RESET_SHIFT)) & CLKCTL4_SDIO1FCLKDIV_RESET_MASK)

#define CLKCTL4_SDIO1FCLKDIV_HALT_MASK           (0x40000000U)
#define CLKCTL4_SDIO1FCLKDIV_HALT_SHIFT          (30U)
/*! HALT - Divider Counter Halt
 *  0b0..No effect
 *  0b1..Halts (stops) the divider counter.
 */
#define CLKCTL4_SDIO1FCLKDIV_HALT(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL4_SDIO1FCLKDIV_HALT_SHIFT)) & CLKCTL4_SDIO1FCLKDIV_HALT_MASK)

#define CLKCTL4_SDIO1FCLKDIV_REQFLAG_MASK        (0x80000000U)
#define CLKCTL4_SDIO1FCLKDIV_REQFLAG_SHIFT       (31U)
/*! REQFLAG - Request Flag
 *  0b0..The change to the divider value has been finished.
 *  0b1..A change is being made to the divider value.
 */
#define CLKCTL4_SDIO1FCLKDIV_REQFLAG(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL4_SDIO1FCLKDIV_REQFLAG_SHIFT)) & CLKCTL4_SDIO1FCLKDIV_REQFLAG_MASK)
/*! @} */

/*! @name DPHYCLKSEL - MIPI_DSI_Host PHY Clock Source Select */
/*! @{ */

#define CLKCTL4_DPHYCLKSEL_SEL_MASK              (0x3U)
#define CLKCTL4_DPHYCLKSEL_SEL_SHIFT             (0U)
/*! SEL - MIPI_DSI_Host PHY Clock Source Select
 *  0b00..baseclk_md2
 *  0b01..Reserved
 *  0b10..fro0_max
 *  0b11..audio_pll_pfd2
 */
#define CLKCTL4_DPHYCLKSEL_SEL(x)                (((uint32_t)(((uint32_t)(x)) << CLKCTL4_DPHYCLKSEL_SEL_SHIFT)) & CLKCTL4_DPHYCLKSEL_SEL_MASK)

#define CLKCTL4_DPHYCLKSEL_SEL_EN_MASK           (0x4U)
#define CLKCTL4_DPHYCLKSEL_SEL_EN_SHIFT          (2U)
/*! SEL_EN - Clock Mux Output Enable
 *  0b0..Gates mux output for MIPI_DSI_Host PHY clock.
 *  0b1..Enables mux output for MIPI_DSI_Host PHY clock.
 */
#define CLKCTL4_DPHYCLKSEL_SEL_EN(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL4_DPHYCLKSEL_SEL_EN_SHIFT)) & CLKCTL4_DPHYCLKSEL_SEL_EN_MASK)
/*! @} */

/*! @name DPHYCLKDIV - MIPI_DSI_Host PHY Clock Divider */
/*! @{ */

#define CLKCTL4_DPHYCLKDIV_DIV_MASK              (0xFFU)
#define CLKCTL4_DPHYCLKDIV_DIV_SHIFT             (0U)
/*! DIV - Clock Divider Value Select */
#define CLKCTL4_DPHYCLKDIV_DIV(x)                (((uint32_t)(((uint32_t)(x)) << CLKCTL4_DPHYCLKDIV_DIV_SHIFT)) & CLKCTL4_DPHYCLKDIV_DIV_MASK)

#define CLKCTL4_DPHYCLKDIV_BUSY_MASK             (0x10000000U)
#define CLKCTL4_DPHYCLKDIV_BUSY_SHIFT            (28U)
/*! BUSY - Busy Flag
 *  0b0..The CLKOUT is outputted with the new divider value.
 *  0b1..A change is being made to the divider value.
 */
#define CLKCTL4_DPHYCLKDIV_BUSY(x)               (((uint32_t)(((uint32_t)(x)) << CLKCTL4_DPHYCLKDIV_BUSY_SHIFT)) & CLKCTL4_DPHYCLKDIV_BUSY_MASK)

